armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F0xx/Keil.STM32F0xx_DFP.pdsc
            ROMTableBase = ReadAP(0xF8) &amp; ~0x3;

            pidr1 = Read32(ROMTableBase + 0x0FE4);
            pidr2 = Read32(ROMTableBase + 0x0FE8);
            jep106id = ((pidr2 &amp; 0x7) &lt;&lt; 4 ) | ((pidr1 &gt;&gt; 4) &amp; 0xF);
          </block>

          <control if="jep106id != 0x20">
            <block>
              Query(0, "Not a genuine ST Device! Abort connection", 1);
              Message(2, "Not a genuine ST Device! Abort connection.");
            </block>
          </control>
        </sequence>
      </sequences>

      <!-- ************************  Subfamily 'STM32F030'  **************************** -->
      <subFamily DsubFamily="STM32F030">
        <processor Dclock="48000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F0xx/Include/stm32f0xx.h"/>
        <debug svd="CMSIS/SVD/STM32F0x0.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F030_070.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <book name="Documentation/DM00091010.pdf" title="STM32F030x4/x6/x8/xC, STM32F070x6/xB Reference Manual"/>
        <book name="Documentation/DM00088500.pdf" title="STM32F030 Data Sheet"/>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="ADC"           n="1"       m="12"/>
        <feature type="Temp"          n="-40"     m="85"/>
        <feature type="VCC"           n="2.40"    m="3.60"/>

        <!-- *************************  Device 'STM32F030C6'  ***************************** -->
        <device Dname="STM32F030C6">
          <compile define="STM32F030x6"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="4"       m="16"/>
          <feature type="IOs"           n="39"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="1"       m="6000000"/>
          <variant Dvariant="STM32F030C6Tx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F030C8'  ***************************** -->
        <device Dname="STM32F030C8">
          <compile define="STM32F030x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="IOs"           n="39"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"       m="6000000"/>
          <variant Dvariant="STM32F030C8Tx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F030CC'  ***************************** -->
        <device Dname="STM32F030CC">
          <compile define="STM32F030xC"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="4"       m="16"/>
          <feature type="IOs"           n="39"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="1"       m="6000000"/>
          <variant Dvariant="STM32F030CCTx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F030F4'  ***************************** -->
        <device Dname="STM32F030F4">
          <compile define="STM32F030x6"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00004000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_16.FLM"  start="0x08000000" size="0x00004000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="4"       m="16"/>
          <feature type="IOs"           n="15"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="1"       m="6000000"/>
          <variant Dvariant="STM32F030F4Px">
            <feature type="SOP" n="20"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F030K6'  ***************************** -->
        <device Dname="STM32F030K6">
          <compile define="STM32F030x6"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_32.FLM"  start="0x08000000" size="0x00008000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="4"       m="16"/>
          <feature type="IOs"           n="26"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="1"       m="6000000"/>
          <variant Dvariant="STM32F030K6Tx">
            <feature type="QFP" n="32"/>
          </variant>          
        </device>

        <!-- *************************  Device 'STM32F030R8'  ***************************** -->
        <device Dname="STM32F030R8">
          <compile define="STM32F030x8"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="6"       m="16"/>
          <feature type="IOs"           n="55"/>
          <feature type="SPI"           n="2"       m="18000000"/>
          <feature type="I2C"           n="2"/>
          <feature type="USART"         n="2"       m="6000000"/>
          <variant Dvariant="STM32F030R8Tx">
            <feature type="QFP" n="64"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F030RC'  ***************************** -->
        <device Dname="STM32F030RC">
          <compile define="STM32F030xC"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00040000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00008000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_256.FLM" start="0x08000000" size="0x00040000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="4"       m="16"/>
          <feature type="IOs"           n="39"/>
          <feature type="SPI"           n="1"       m="18000000"/>
          <feature type="I2C"           n="1"/>
          <feature type="USART"         n="1"       m="6000000"/>
          <variant Dvariant="STM32F030RCTx">
            <feature type="QFP" n="48"/>
          </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F031'  **************************** -->
      <subFamily DsubFamily="STM32F031">
        <processor Dclock="48000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F0xx/Include/stm32f0xx.h" define="STM32F031x6"/>
        <debug svd="CMSIS/SVD/STM32F0x1.svd"/>

