armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F0xx/Keil.STM32F0xx_DFP.pdsc
        <!-- *************************  Device 'STM32F071CB'  ***************************** -->
        <device Dname="STM32F071CB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="7"       m="16"/>
          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="37"/>
          <variant Dvariant="STM32F071CBTx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F071CBUx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F071CBYx">
            <feature type="CSP" n="49"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F071RB'  ***************************** -->
        <device Dname="STM32F071RB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="7"       m="16"/>
          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F071RBTx">
            <feature type="QFP" n="64"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F071V8'  ***************************** -->
        <device Dname="STM32F071V8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="9"       m="16"/>
          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="87"/>
          <variant Dvariant="STM32F071V8Hx">
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="STM32F071V8Tx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F071VB'  ***************************** -->
        <device Dname="STM32F071VB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="Timer"         n="9"       m="16"/>
          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="87"/>
          <variant Dvariant="STM32F071VBHx">
            <feature type="BGA" n="100"/>
          </variant>
          <variant Dvariant="STM32F071VBTx">
            <feature type="QFP" n="100"/>
          </variant>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32F072'  **************************** -->
      <subFamily DsubFamily="STM32F072">
        <processor Dclock="48000000"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32F0xx/Include/stm32f0xx.h" define="STM32F072xB"/>
        <debug svd="CMSIS/SVD/STM32F0x2.svd"/>

        <debugvars configfile="CMSIS/Debug/STM32F0x1_0x2_0x8.dbgconf">
          __var DbgMCU_CR      = 0x00000006;   // DBGMCU_CR:  DBG_STOP, DBG_STANDBY
          __var DbgMCU_APB1_Fz = 0x00000000;   // DGBMCU_APB1_FZ: All Peripherals Operate as in Normal Mode
          __var DbgMCU_APB2_Fz = 0x00000000;   // DGBMCU_APB2_FZ: All Peripherals Operate as in Normal Mode
        </debugvars>

        <book name="Documentation/DM00031936.pdf" title="STM32F0x1/STM32F0x2/STM32F0x8 Reference Manual"/>
        <book name="Documentation/DM00090510.pdf" title="STM32F072 Data Sheet"/>

        <feature type="WDT"           n="2"/>
        <feature type="RTC"           n="32768"/>
        <feature type="Timer"         n="8"       m="16"/>
        <feature type="Timer"         n="1"       m="32"/>
        <feature type="DAC"           n="2"       m="12"/>
        <feature type="SPI"           n="2"       m="18000000"/>
        <feature type="I2S"           n="2"/>
        <feature type="I2C"           n="2"/>
        <feature type="USART"         n="4"       m="6000000"/>
        <feature type="ComOther"      n="1"                           name="CEC Interface"/>
        <feature type="USBD"          n="1"/>
        <feature type="CAN"           n="1"/>
        <feature type="Temp"          n="-40"     m="105"/>
        <feature type="VCC"           n="2.00"    m="3.60"/>

        <!-- *************************  Device 'STM32F072C8'  ***************************** -->
        <device Dname="STM32F072C8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="37"/>
          <variant Dvariant="STM32F072C8Tx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F072C8Ux">
            <feature type="QFP" n="48"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F072CB'  ***************************** -->
        <device Dname="STM32F072CB">
          <memory id="IROM1"                              start="0x08000000" size="0x00020000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_128.FLM" start="0x08000000" size="0x00020000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="13"      m="12"/>
          <feature type="IOs"           n="37"/>
          <variant Dvariant="STM32F072CBTx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F072CBUx">
            <feature type="QFP" n="48"/>
          </variant>
          <variant Dvariant="STM32F072CBYx">
            <feature type="CSP" n="49"/>
          </variant>
        </device>

        <!-- *************************  Device 'STM32F072R8'  ***************************** -->
        <device Dname="STM32F072R8">
          <memory id="IROM1"                              start="0x08000000" size="0x00010000" startup="1" default="1"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00004000" init   ="0" default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_64.FLM"  start="0x08000000" size="0x00010000"             default="1"/>
          <algorithm name="CMSIS/Flash/STM32F0xx_OPT.FLM" start="0x1FFFF800" size="0x00000010"             default="0"/>

          <feature type="ADC"           n="19"      m="12"/>
          <feature type="IOs"           n="51"/>
          <variant Dvariant="STM32F072R8Tx">
            <feature type="QFP" n="64"/>
          </variant>
        </device>

