armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F0xx/Keil.STM32F0xx_DFP.pdsc
    <condition id="STM32F058xx">
      <description>STMicroelectronics STM32F058xx Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F058*"/>
    </condition>
    <condition id="STM32F070x6">
      <description>STMicroelectronics STM32F070x6 Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F070?6*"/>
    </condition>
    <condition id="STM32F070xB">
      <description>STMicroelectronics STM32F070xB Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F070?B*"/>
    </condition>
    <condition id="STM32F071xB">
      <description>STMicroelectronics STM32F071xB Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F071?[8B]*"/>
    </condition>
    <condition id="STM32F072xB">
      <description>STMicroelectronics STM32F072xB Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F072?[8B]*"/>
    </condition>
    <condition id="STM32F078xx">
      <description>STMicroelectronics STM32F078xx Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F078*"/>
    </condition>
    <condition id="STM32F091xC">
      <description>STMicroelectronics STM32F091xC Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F091?[BC]*"/>
    </condition>
    <condition id="STM32F098xx">
      <description>STMicroelectronics STM32F098xx Devices</description>
      <require Dvendor="STMicroelectronics:13"  Dname="STM32F098*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32F0 CMSIS">
      <description>STMicroelectronics STM32F0 Series Device and CMSIS-Core</description>
      <require condition="STM32F0"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
    </condition>
    <condition id="STM32F030x6 CMSIS">
      <description>STMicroelectronics STM32F030x6 Devices and CMSIS-Core</description>
      <require condition="STM32F030x6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F030x8 CMSIS">
      <description>STMicroelectronics STM32F030x8 Devices and CMSIS-Core</description>
      <require condition="STM32F030x8"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F030xC CMSIS">
      <description>STMicroelectronics STM32F030xC Devices and CMSIS-Core</description>
      <require condition="STM32F030xC"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F031x6 CMSIS">
      <description>STMicroelectronics STM32F031x6 Devices and CMSIS-Core</description>
      <require condition="STM32F031x6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F038xx CMSIS">
      <description>STMicroelectronics STM32F038xx Devices and CMSIS-Core</description>
      <require condition="STM32F038xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F042x6 CMSIS">
      <description>STMicroelectronics STM32F042x6 Devices and CMSIS-Core</description>
      <require condition="STM32F042x6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F048xx CMSIS">
      <description>STMicroelectronics STM32F048xx Devices and CMSIS-Core</description>
      <require condition="STM32F048xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F051x8 CMSIS">
      <description>STMicroelectronics STM32F051x8 Devices and CMSIS-Core</description>
      <require condition="STM32F051x8"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F058xx CMSIS">
      <description>STMicroelectronics STM32F058xx Devices and CMSIS-Core</description>
      <require condition="STM32F058xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F070x6 CMSIS">
      <description>STMicroelectronics STM32F070x6 Devices and CMSIS-Core</description>
      <require condition="STM32F070x6"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F070xB CMSIS">
      <description>STMicroelectronics STM32F070xB Devices and CMSIS-Core</description>
      <require condition="STM32F070xB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F071xB CMSIS">
      <description>STMicroelectronics STM32F071xB Devices and CMSIS-Core</description>
      <require condition="STM32F071xB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F072xB CMSIS">
      <description>STMicroelectronics STM32F072xB Devices and CMSIS-Core</description>
      <require condition="STM32F072xB"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F078xx CMSIS">
      <description>STMicroelectronics STM32F078xx Devices and CMSIS-Core</description>
      <require condition="STM32F078xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F091xC CMSIS">
      <description>STMicroelectronics STM32F091xC Devices and CMSIS-Core</description>
      <require condition="STM32F091xC"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="STM32F098xx CMSIS">
      <description>STMicroelectronics STM32F098xx Devices and CMSIS-Core</description>
      <require condition="STM32F098xx"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + Compiler Conditions -->
    <condition id="STM32F0 ARMCC">
      <description>STMicroelectronics STM32F0 Devices and ARMCC Compiler</description>
      <require condition="STM32F0"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F030x6 ARMCC">
      <description>STMicroelectronics STM32F030x6 Devices and ARMCC Compiler</description>
      <require condition="STM32F030x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F030x8 ARMCC">
      <description>STMicroelectronics STM32F030x8 Devices and ARMCC Compiler</description>
      <require condition="STM32F030x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F030xC ARMCC">
      <description>STMicroelectronics STM32F030xC Devices and ARMCC Compiler</description>
      <require condition="STM32F030xC"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F031x6 ARMCC">
      <description>STMicroelectronics STM32F031x6 Devices and ARMCC Compiler</description>
      <require condition="STM32F031x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F038xx ARMCC">
      <description>STMicroelectronics STM32F038xx Devices and ARMCC Compiler</description>
      <require condition="STM32F038xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F042x6 ARMCC">
      <description>STMicroelectronics STM32F042x6 Devices and ARMCC Compiler</description>
      <require condition="STM32F042x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F048xx ARMCC">
      <description>STMicroelectronics STM32F048xx Devices and ARMCC Compiler</description>
      <require condition="STM32F048xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F051x8 ARMCC">
      <description>STMicroelectronics STM32F051x8 Devices and ARMCC Compiler</description>
      <require condition="STM32F051x8"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F058xx ARMCC">
      <description>STMicroelectronics STM32F058xx Devices and ARMCC Compiler</description>
      <require condition="STM32F058xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F070x6 ARMCC">
      <description>STMicroelectronics STM32F070x6 Devices and ARMCC Compiler</description>
      <require condition="STM32F070x6"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F070xB ARMCC">
      <description>STMicroelectronics STM32F070xB Devices and ARMCC Compiler</description>
      <require condition="STM32F070xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F071xB ARMCC">
      <description>STMicroelectronics STM32F071xB Devices and ARMCC Compiler</description>
      <require condition="STM32F071xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F072xB ARMCC">
      <description>STMicroelectronics STM32F072xB Devices and ARMCC Compiler</description>
      <require condition="STM32F072xB"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F078xx ARMCC">
      <description>STMicroelectronics STM32F078xx Devices and ARMCC Compiler</description>
      <require condition="STM32F078xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>
    <condition id="STM32F091xC ARMCC">
      <description>STMicroelectronics STM32F091xC Devices and ARMCC Compiler</description>
      <require condition="STM32F091xC"/>
      <require condition="Compiler ARMCC"/>
    </condition>
