armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F0xx/Keil.STM32F0xx_DFP.pdsc
    <condition id="STM32F098xx ARMCC">
      <description>STMicroelectronics STM32F098xx Devices and ARMCC Compiler</description>
      <require condition="STM32F098xx"/>
      <require condition="Compiler ARMCC"/>
    </condition>

    <!-- Device + CMSIS + STM32CubeMX Conditions -->
    <condition id="STM32F0 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F0 Series Device, CMSIS-Core and STM32CubeMX</description>
      <require condition="STM32F0"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F030x6 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F030x6 Devices and CMSIS-Core</description>
      <require condition="STM32F030x6 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F030x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F030x8 Devices and CMSIS-Core</description>
      <require condition="STM32F030x8 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F030xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F030xC Devices and CMSIS-Core</description>
      <require condition="STM32F030xC CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F031x6 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F031x6 Devices and CMSIS-Core</description>
      <require condition="STM32F031x6 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F038xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F038xx Devices and CMSIS-Core</description>
      <require condition="STM32F038xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F042x6 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F042x6 Devices and CMSIS-Core</description>
      <require condition="STM32F042x6 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F048xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F048xx Devices and CMSIS-Core</description>
      <require condition="STM32F048xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F051x8 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F051x8 Devices and CMSIS-Core</description>
      <require condition="STM32F051x8 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F058xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F058xx Devices and CMSIS-Core</description>
      <require condition="STM32F058xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F070x6 CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F070x6 Devices and CMSIS-Core</description>
      <require condition="STM32F070x6 CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F070xB CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F070xB Devices and CMSIS-Core</description>
      <require condition="STM32F070xB CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F071xB CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F071xB Devices and CMSIS-Core</description>
      <require condition="STM32F071xB CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F072xB CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F072xB Devices and CMSIS-Core</description>
      <require condition="STM32F072xB CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F078xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F078xx Devices and CMSIS-Core</description>
      <require condition="STM32F078xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F091xC CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F091xC Devices and CMSIS-Core</description>
      <require condition="STM32F091xC CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>
    <condition id="STM32F098xx CMSIS STM32CubeMX">
      <description>STMicroelectronics STM32F098xx Devices and CMSIS-Core</description>
      <require condition="STM32F098xx CMSIS"/>
      <require Cbundle="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX"/>
    </condition>

    <condition id="STM32F072xB CMSIS STM32CubeMX SPI">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX and CMSIS SPI driver</description>
      <require condition="STM32F072xB CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
    </condition>
    <condition id="STM32F091xC CMSIS STM32CubeMX SPI">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX and CMSIS SPI driver</description>
      <require condition="STM32F091xC CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
    </condition>

    <condition id="STM32F072B-EVAL CMSIS STM32CubeMX SPI GLCD">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX and SPI GLCD</description>
      <require condition="STM32F072xB CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
      <require Cclass="Graphics Display" Cgroup="STM32072B-EVAL" Cvariant="SPI IF"/>
    </condition>

    <condition id="STM32F091C-EVAL CMSIS STM32CubeMX SPI GLCD">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX and SPI GLCD</description>
      <require condition="STM32F091xC CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"     Cgroup="SPI"/>
      <require Cclass="Graphics Display" Cgroup="STM32072B-EVAL" Cvariant="SPI IF"/>
    </condition>
    
    <condition id="STM32F0 CMSIS STM32CubeMX Graphics SPI GLCD">
      <description>STMicroelectronics STM32F0 Devices, CMSIS-Core, STM32CubeMX, Graphics core and SPI GLCD</description>
      <require condition="STM32F0 CMSIS STM32CubeMX"/>
      <require Cclass="CMSIS Driver"  Cgroup="SPI"/>
      <require Cclass="Graphics"      Cgroup="CORE"/>
      <accept  Cclass="Board Support" Cgroup="emWin LCD" Cvariant="SPI IF"/>
    </condition>
    
     <condition id="STM32F0 STARTUP CORTEX GPIO RCC FLASH">
      <description>STMicroelectronics STM32F0 devices, Startup and HAL CORTEX, GPIO, RCC and FLASH</description>
      <require condition="STM32F0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="CORTEX"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="FLASH"/>
    </condition>
