armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F0xx/Keil.STM32F0xx_DFP.pdsc
    <condition id="STM32F0 HAL">
      <description>STMicroelectronics STM32F0 devices and HAL </description>
      <require condition="STM32F0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="COMMON"/>
    </condition>
    <condition id="STM32F0 HAL DMA">
      <description>STMicroelectronics STM32F0 Devices, HAL, and DMA peripheral</description>
      <require condition="STM32F0 HAL"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32F0 LL">
      <description>STMicroelectronics STM32F0 devices and LL </description>
      <require condition="STM32F0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="COMMON"/>
    </condition>
    <condition id="STM32F0 STARTUP LL UTILS RCC PWR">
      <description>STMicroelectronics STM32F0 Device and LL</description>
      <require condition="STM32F0"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="Startup"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="RCC"/>
      <require Cbundle="Standalone" Cclass="Device" Cgroup="STM32Cube LL" Csub="PWR"/>
    </condition>
  </conditions>

  <generators>
    <!-- This generator is launched if any component referencing this generator by 'id' is selected and the specified <gpdsc> file does not exist -->
    <generator id="STM32CubeMX">
      <description>ST Microelectronics: STCubeMX Environment</description>
      <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command> <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <workingDir>$PRTE/Device</workingDir> <!-- path is specified either absolute or relative to PDSC or GPDSC file. If not specified it is the project directory configured by the environment -->
      <arguments>
        <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>$D</argument>
        <!-- Project path and project name (as configured by environment) -->
        <argument>#P</argument>
        <!-- absolute or relative to workingDir. $S = Device Family Pack base folder -->
        <argument>$S</argument>
      </arguments>
      <!-- path is either absolute or relative to working directory -->
      <gpdsc name="$PRTE/Device/$D/FrameworkCubeMX.gpdsc"/>
    </generator>
  </generators>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" Capiversion="1.0.0" exclusive="1">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

  <components>
    <bundle Cbundle="STM32CubeMX" Cclass="Device" isDefaultVariant="true" Cversion="1.0.0">
      <description>Peripheral, Clock and Pin configuration are managed by STM32CubeMX</description>
      <doc>MDK/CubeMX/Documentation/index.html</doc>
      <component Cgroup="Startup" Cversion="2.3.3" condition="STM32F0 CMSIS STM32CubeMX">  <!-- Cversion is necessary -->
        <description>System Startup for STMicroelectronics STM32F0 Series</description>
        <RTE_Components_h>
          <!-- the following content goes into file 'RTE_Components.h' -->
          #define RTE_DEVICE_STARTUP_STM32F0XX    /* Device Startup for STM32F0 */
        </RTE_Components_h>

        <files>
          <!-- Flash Option Bytes templates -->
          <file category="source" condition="STM32F0 ARMCC" name="MDK/Device/Source/ARM/STM32F0xx_OPT.s" attr="template" select="Flash Option Bytes"/>
        </files>
      </component>

      <component generator="STM32CubeMX" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="1.0.0" condition="STM32F0">
        <description>Configuration via STM32CubeMX</description>
        <RTE_Components_h>
          #define RTE_DEVICE_FRAMEWORK_CUBE_MX
        </RTE_Components_h>
        <files>
  <!--
          <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
  -->
          <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0.0"/>
          <file category="other"   name="MDK/CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
          <file category="other"   name="MDK/CubeMX/MX_Device_h.ftl" version ="1.0.1"/>
        </files>
      </component>

     <component Cgroup="STM32Cube HAL" Cversion="1.7.0" condition="STM32F0 CMSIS STM32CubeMX">
        <description>STM32Cube HAL Drivers</description>
        <RTE_Components_h>
          #define RTE_DEVICE_CUBE_MX_HAL
        </RTE_Components_h>
        <files>
          <file category="source"  name="MDK/Driver/stm32f0xx_ll.c"/>
          <file category="include" name="Drivers/STM32F0xx_HAL_Driver/Inc/"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_adc.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_adc_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_can.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_cec.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_comp.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_cortex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_crc.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_crc_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_dac.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_dac_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_dma.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_flash.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_flash_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_gpio.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_i2c.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_i2c_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_i2s.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_irda.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_iwdg.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_pcd.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_pcd_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_pwr.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_pwr_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_rcc.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_rcc_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_rtc.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_rtc_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_smartcard.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_smartcard_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_smbus.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_spi.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_spi_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_tim.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_tim_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_tsc.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_uart.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_uart_ex.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_usart.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_wwdg.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_adc.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_comp.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_crc.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_crs.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_dac.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_dma.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_exti.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_gpio.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_i2c.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_pwr.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_rcc.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_rtc.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_spi.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_tim.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_usart.c"/>
          <file category="source"  name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_ll_utils.c"/>
        </files>
      </component>
    </bundle>

    <bundle Cbundle="Standalone" Cclass="Device" Cversion="1.0.0">
      <description>All HAL and LL peripheral APIs are selectable as individual components.</description>
      <doc>Documentation/STM32CubeF0GettingStarted.pdf</doc>
      <component  Cgroup="Startup" condition="STM32F0 CMSIS">
        <description>System Startup for STMicroelectronics</description>
        <RTE_Components_h>
          #define RTE_DEVICE_STARTUP_STM32F0XX    /* Device Startup for STM32F0 */
        </RTE_Components_h>

        <files>
          <!--  include folder -->

          <file category="include" name="Drivers/CMSIS/Device/ST/STM32F0xx/Include/"/>

          <!-- Flash Option Bytes templates -->
          <file category="source" condition="STM32F0 ARMCC" name="MDK/Device/Source/ARM/STM32F0xx_OPT.s" attr="template" select="Flash Option Bytes"/>

          <file category="header" name="Drivers/CMSIS/Device/ST/STM32F0xx/Include/stm32f0xx.h"/>

          <!-- startup files -->
          <!-- ARM Compiler Toolchain -->
          <file category="source" condition="STM32F030x6 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f030x6.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F030x8 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f030x8.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F030xC ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f030xc.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F031x6 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f031x6.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F038xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f038xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F042x6 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f042x6.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F048xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f048xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F051x8 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f051x8.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F058xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f058xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F070x6 ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f070x6.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F070xB ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f070xb.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F071xB ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f071xb.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F072xB ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f072xb.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F078xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f078xx.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F091xC ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f091xc.s" attr="config" version="2.3.3"/>
          <file category="source" condition="STM32F098xx ARMCC"  name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/arm/startup_stm32f098xx.s" attr="config" version="2.3.3"/>

          <!-- system file -->
          <file category="source" name="Drivers/CMSIS/Device/ST/STM32F0xx/Source/Templates/system_stm32f0xx.c" attr="config" version="2.3.3"/>
        </files>
      </component>

      <!-- STM32F0xx HAL Drivers -->
      <component Cgroup="STM32Cube HAL" Csub="COMMON" Cversion="1.7.0" condition="STM32F0 STARTUP CORTEX GPIO RCC FLASH">
        <description>Common HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_COMMON
        </RTE_Components_h>
        <files>
          <file category="header" name="Drivers/STM32F0xx_HAL_Driver/Inc/Legacy/stm32_hal_legacy.h"/>
          <file category="header" name="Drivers/STM32F0xx_HAL_Driver/Inc/stm32f0xx_hal.h"/>
          <file category="header" name="Drivers/STM32F0xx_HAL_Driver/Inc/stm32f0xx_hal_def.h"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal.c"/>
          <file category="header" name="MDK/Templates/Inc/stm32f0xx_hal_conf.h" attr="config"   version="1.9.0"/>
          <file category="source" name="MDK/Templates/Src/stm32f0xx_hal_msp.c"  attr="template" select="MCU Specific HAL Initialization / De-Initialization"/>
          <file category="header" name="MDK/Templates/Inc/stm32f0xx_it.h"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="source" name="MDK/Templates/Src/stm32f0xx_it.c"       attr="template" select="Exception Handlers and Peripheral IRQ"/>
          <file category="header" name="MDK/Templates/Inc/main.h"               attr="template" select="'main' module for STM32Cube"/>
          <file category="source" name="MDK/Templates/Src/main.c"               attr="template" select="'main' module for STM32Cube"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="ADC" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>Analog-to-digital converter (ADC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_ADC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_adc.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_adc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CAN" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Controller area network (CAN) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CAN
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_can.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CEC" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Consumer Electronics Control (CEC) HAL driver </description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CEC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_cec.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="COMP" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Analog Comparator (COMP) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_COMP
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_comp.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CORTEX" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Cortex HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CORTEX
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_cortex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="CRC" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>CRC calculation unit (CRC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_CRC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_crc.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_crc_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="DAC" Cversion="1.7.0" condition="STM32F0 HAL DMA">
        <description>Digital-to-analog converter (DAC) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_DAC
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_dac.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_dac_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="DMA" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>DMA controller (DMA) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_DMA
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_dma.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="FLASH" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>Embedded Flash memory HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_FLASH
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_flash.c"/>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_flash_ex.c"/>
        </files>
      </component>
      <component Cgroup="STM32Cube HAL" Csub="GPIO" Cversion="1.7.0" condition="STM32F0 HAL">
        <description>General-purpose I/O (GPIO) HAL driver</description>
        <RTE_Components_h>
          #define RTE_DEVICE_HAL_GPIO
        </RTE_Components_h>
        <files>
          <file category="source" name="Drivers/STM32F0xx_HAL_Driver/Src/stm32f0xx_hal_gpio.c"/>
        </files>
      </component>
