armfly/H7-TOOL_STM32H7_App/Doc/存放到eMMC磁盘的文件/H7-TOOL/Programmer/Device/ST/STM32F0xx/Keil.STM32F0xx_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="I2C"                          Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX">
      <description>I2C Driver for STM32F0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/I2C_STM32F0xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI"                          Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX">
      <description>SPI Driver for STM32F0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SPI_STM32F0xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART IrDA"      Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX">
      <description>USART Driver (IrDA mode) for STM32F0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_IrDA         /* Driver USART1 */
        #define RTE_Drivers_USART2_IrDA         /* Driver USART2 */
        #define RTE_Drivers_USART3_IrDA         /* Driver USART3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/IrDA_STM32F0xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART SmartCard" Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX">
      <description>USART Driver (SmartCard mode) for STM32F0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_SmartCard    /* Driver USART1 */
        #define RTE_Drivers_USART2_SmartCard    /* Driver USART2 */
        #define RTE_Drivers_USART3_SmartCard    /* Driver USART3 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SmartCard_STM32F0xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART Async"     Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX">
      <description>USART Driver (Async mode) for STM32F0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_Async        /* Driver USART1 */
        #define RTE_Drivers_USART2_Async        /* Driver USART2 */
        #define RTE_Drivers_USART3_Async        /* Driver USART3 */
        #define RTE_Drivers_USART4_Async        /* Driver USART4 */
        #define RTE_Drivers_USART5_Async        /* Driver USART5 */
        #define RTE_Drivers_USART6_Async        /* Driver USART6 */
        #define RTE_Drivers_USART7_Async        /* Driver USART7 */
        #define RTE_Drivers_USART8_Async        /* Driver USART8 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/UART_STM32F0xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="USART Sync"      Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX">
      <description>USART Driver (Sync mode) for STM32F0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1_Sync         /* Driver USART1 */
        #define RTE_Drivers_USART2_Sync         /* Driver USART2 */
        #define RTE_Drivers_USART3_Sync         /* Driver USART3 */
        #define RTE_Drivers_USART4_Sync         /* Driver USART4 */
        #define RTE_Drivers_USART5_Sync         /* Driver USART5 */
        #define RTE_Drivers_USART6_Sync         /* Driver USART6 */
        #define RTE_Drivers_USART7_Sync         /* Driver USART7 */
        #define RTE_Drivers_USART8_Sync         /* Driver USART8 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USART_STM32F0xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device"                   Capiversion="2.1.0" Cversion="1.0.0" condition="STM32F0 CMSIS STM32CubeMX">
      <description>USB Device Driver for STM32F0 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/USBD_STM32F0xx.c"/>
      </files>
    </component>

    <!-- STM32F030-Discovery Board Support -->
    <bundle Cbundle="STM32F030-Discovery" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32F030-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F030x8 CMSIS STM32CubeMX">
      <description>LED driver for STMicroelectronics STM32F030-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F030-Discovery/Common/LED_STM32F030-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F030x8 CMSIS STM32CubeMX">
      <description>Button driver for STMicroelectronics STM32F030-Discovery Board</description>
        <files>
        <file category="sourceC" name="MDK/Boards/ST/STM32F030-Discovery/Common/Buttons_STM32F030-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F051-Discovery Board Support -->
    <bundle Cbundle="STM32F051-Discovery" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32F051-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F051x8 CMSIS STM32CubeMX">
      <description>LED driver for STMicroelectronics STM32F051-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F051-Discovery/Common/LED_STM32F051-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F051x8 CMSIS STM32CubeMX">
      <description>Button driver for STMicroelectronics STM32F051-Discovery Board</description>
        <files>
        <file category="sourceC" name="MDK/Boards/ST/STM32F051-Discovery/Common/Buttons_STM32F051-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32F072-Discovery Board Support -->
    <bundle Cbundle="STM32F072-Discovery" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32F072-Discovery Board</description>
      <doc></doc>
      <component Cgroup="LED" Capiversion="1.0.0" condition="STM32F072xB CMSIS STM32CubeMX">
      <description>LED driver for STMicroelectronics STM32F072-Discovery Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32F072-Discovery/Common/LED_STM32F072-Discovery.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="STM32F072xB CMSIS STM32CubeMX">
      <description>Button driver for STMicroelectronics STM32F072-Discovery Board</description>
        <files>
        <file category="sourceC" name="MDK/Boards/ST/STM32F072-Discovery/Common/Buttons_STM32F072-Discovery.c"/>
        </files>
      </component>
    </bundle>

    <!-- STM32072B-EVAL Board Support -->
    <bundle Cbundle="STM32072B-EVAL" Cclass="Board Support" Cversion="1.0.0">
      <description>STMicroelectronics STM32072B-EVAL Board</description>
      <doc></doc>
      <component Cgroup="A/D Converter" Capiversion="1.0.0" condition="STM32F072xB CMSIS STM32CubeMX">
        <description>A/D Converter driver for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32072B-EVAL/Common/ADC_STM32072B-EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick" Capiversion="1.0.0" condition="STM32F072xB CMSIS STM32CubeMX">
        <description>Joystick Interface for STMicroelectronics STM32303C-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32072B-EVAL/Common/Joystick_STM32072B-EVAL.c"/>
        </files>
      </component>
